========
Boolean literals
========

true
false

---

(source_file
  (boolean_literal)
  (boolean_literal))

========
Comparison operators
========

42 == 42
10 != 20
5 < 10
5 <= 5
10 > 5
10 >= 10

---

(source_file
  (binary_expression
    left: (integer_literal)
    operator: (equal)
    right: (integer_literal))
  (binary_expression
    left: (integer_literal)
    operator: (not_equal)
    right: (integer_literal))
  (binary_expression
    left: (integer_literal)
    operator: (less)
    right: (integer_literal))
  (binary_expression
    left: (integer_literal)
    operator: (less_equal)
    right: (integer_literal))
  (binary_expression
    left: (integer_literal)
    operator: (greater)
    right: (integer_literal))
  (binary_expression
    left: (integer_literal)
    operator: (greater_equal)
    right: (integer_literal)))

========
Logical operators
========

true and false
true or false

---

(source_file
  (binary_expression
    left: (boolean_literal)
    operator: (and)
    right: (boolean_literal))
  (binary_expression
    left: (boolean_literal)
    operator: (or)
    right: (boolean_literal)))

========
Operator precedence - and vs or
========

true and false or true

---

(source_file
  (binary_expression
    left: (binary_expression
      left: (boolean_literal)
      operator: (and)
      right: (boolean_literal))
    operator: (or)
    right: (boolean_literal)))

========
Operator precedence - comparison vs logical
========

10 < 20 and 30 > 20

---

(source_file
  (binary_expression
    left: (binary_expression
      left: (integer_literal)
      operator: (less)
      right: (integer_literal))
    operator: (and)
    right: (binary_expression
      left: (integer_literal)
      operator: (greater)
      right: (integer_literal))))

========
Subtraction and division
========

42 - 10 / 2

---

(source_file
  (binary_expression
    left: (integer_literal)
    operator: (subtract)
    right: (binary_expression
      left: (integer_literal)
      operator: (divide)
      right: (integer_literal))))

========
Modulo operation
========

100 % 30

---

(source_file
  (binary_expression
    left: (integer_literal)
    operator: (modulo)
    right: (integer_literal)))

========
Complex expression with multiple precedence levels
========

42 + 10 * 2 == 62 and true or false

---

(source_file
  (binary_expression
    left: (binary_expression
      left: (binary_expression
        left: (binary_expression
          left: (integer_literal)
          operator: (add)
          right: (binary_expression
            left: (integer_literal)
            operator: (multiply)
            right: (integer_literal)))
        operator: (equal)
        right: (integer_literal))
      operator: (and)
      right: (boolean_literal))
    operator: (or)
    right: (boolean_literal)))

========
Negative integer_literal
========

-42

---

(source_file
  (unary_expression
    operator: (negative)
    operand: (integer_literal)))

========
Logical not
========

not true

---

(source_file
  (unary_expression
    operator: (not)
    operand: (boolean_literal)))

========
Unary precedence - negative with multiplication
========

-42 * 10

---

(source_file
  (binary_expression
    left: (unary_expression
      operator: (negative)
      operand: (integer_literal))
    operator: (multiply)
    right: (integer_literal)))

========
Unary precedence - not with and
========

not true and false

---

(source_file
  (binary_expression
    left: (unary_expression
      operator: (not)
      operand: (boolean_literal))
    operator: (and)
    right: (boolean_literal)))

========
Chained unary operators
========

not not true

---

(source_file
  (unary_expression
    operator: (not)
    operand: (unary_expression
      operator: (not)
      operand: (boolean_literal))))

========
Negative with binary expression
========

-(1 + 2)

---

(source_file
  (unary_expression
    operator: (negative)
    operand: (parenthesized_expression
      (binary_expression
        left: (integer_literal)
        operator: (add)
        right: (integer_literal)))))

========
Complex expression with unary operators
========

42 + -10 * not true

---

(source_file
  (binary_expression
    left: (integer_literal)
    operator: (add)
    right: (binary_expression
      left: (unary_expression
        operator: (negative)
        operand: (integer_literal))
      operator: (multiply)
      right: (unary_expression
        operator: (not)
        operand: (boolean_literal)))))

========
Simple parenthesized expression
========

(42)

---

(source_file
  (parenthesized_expression
    (integer_literal)))

========
Parenthesized binary expression
========

(1 + 2)

---

(source_file
  (parenthesized_expression
    (binary_expression
      left: (integer_literal)
      operator: (add)
      right: (integer_literal))))

========
Precedence override with parentheses
========

(1 + 2) * 3

---

(source_file
  (binary_expression
    left: (parenthesized_expression
      (binary_expression
        left: (integer_literal)
        operator: (add)
        right: (integer_literal)))
    operator: (multiply)
    right: (integer_literal)))

========
Nested parentheses
========

((1 + 2) * 3)

---

(source_file
  (parenthesized_expression
    (binary_expression
      left: (parenthesized_expression
        (binary_expression
          left: (integer_literal)
          operator: (add)
          right: (integer_literal)))
      operator: (multiply)
      right: (integer_literal))))

========
Complex expression with parentheses and unary operators
========

not (true and false) or (-42 > 10)

---

(source_file
  (binary_expression
    left: (unary_expression
      operator: (not)
      operand: (parenthesized_expression
        (binary_expression
          left: (boolean_literal)
          operator: (and)
          right: (boolean_literal))))
    operator: (or)
    right: (parenthesized_expression
      (binary_expression
        left: (unary_expression
          operator: (negative)
          operand: (integer_literal))
        operator: (greater)
        right: (integer_literal)))))


========
Simple identifiers
========

x
_y
foo
bar_baz
myVar123

---

(source_file
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier))

========
Unicode identifiers
========

α
β
變量
переменная
σκύλος

---

(source_file
  (identifier)
  (identifier)
  (identifier)
  (identifier)
  (identifier))

========
Identifiers in expressions
========

x + y
foo == bar
_test and value

---

(source_file
  (binary_expression
    left: (identifier)
    operator: (add)
    right: (identifier))
  (binary_expression
    left: (identifier)
    operator: (equal)
    right: (identifier))
  (binary_expression
    left: (identifier)
    operator: (and)
    right: (identifier)))

========
Keywords should not be identifiers
========

not notKeyword
var1 and var2
trueValue or falseValue

---

(source_file
  (unary_expression
    operator: (not)
    operand: (identifier))
  (binary_expression
    left: (identifier)
    operator: (and)
    right: (identifier))
  (binary_expression
    left: (identifier)
    operator: (or)
    right: (identifier)))


========
Variable definition where value is int literal
========

let x = 42

---

(source_file
  (variable_definition
    pattern: (identifier)
    value: (integer_literal)))

========
Variable definition with type where value is int literal
========

let x: i32 = 42

---

(source_file
  (variable_definition
    pattern: (identifier)
    type: (primitive_type)
    value: (integer_literal)))

========
Variable definition where value is tuple
========

let x = (42, true)

---

(source_file
  (variable_definition
    pattern: (identifier)
    value: (tuple_expression
      (integer_literal)
      (boolean_literal))))


========
Variable definition where type and value are tuple
========

let x: (i32, bool) = (42, true)

---

(source_file
  (variable_definition
    pattern: (identifier)
    type: (tuple_type
      (primitive_type)
      (primitive_type))
    value: (tuple_expression
      (integer_literal)
      (boolean_literal))))


========
Variable definition with tuple pattern
========

let (x, y): (i32, bool) = (42, true)

---

(source_file
  (variable_definition
    pattern: (tuple_pattern
      (identifier)
      (identifier))
    type: (tuple_type
      (primitive_type)
      (primitive_type))
    value: (tuple_expression
      (integer_literal)
      (boolean_literal))))


========
Variable definition where value is array
========

let x = [2, 4, 6]

---

(source_file
  (variable_definition
    pattern: (identifier)
    value: (array_expression
      (integer_literal)
      (integer_literal)
      (integer_literal))))


========
Variable definition with array pattern
========

let [x, y, z] = [2, 4, 6]

---

(source_file
  (variable_definition
    pattern: (array_pattern
      (identifier)
      (identifier)
      (identifier))
    value: (array_expression
      (integer_literal)
      (integer_literal)
      (integer_literal))))

========
Variable definition with array of tuple pattern
========

let [(a, b), c] = [(1, true), (2, false)]

---

(source_file
  (variable_definition
    pattern: (array_pattern
      (tuple_pattern
        (identifier)
        (identifier))
      (identifier))
    value: (array_expression
      (tuple_expression
        (integer_literal)
        (boolean_literal))
      (tuple_expression
        (integer_literal)
        (boolean_literal)))))


========
Variable definition with typed array of tuple pattern
========

let [(a, b), c]: [2](i32, bool) = [(1, true), (2, false)]

---

(source_file
  (variable_definition
    pattern: (array_pattern
      (tuple_pattern
        (identifier)
        (identifier))
      (identifier))
    type: (array_type
      dimensions: (array_dimensions
        (integer_literal))
      element: (tuple_type
        (primitive_type)
        (primitive_type)))
    value: (array_expression
      (tuple_expression
        (integer_literal)
        (boolean_literal))
      (tuple_expression
        (integer_literal)
        (boolean_literal)))))

========
Variable definition of type matrix
========

let m: [2, 3]i32 = [[1, 2, 3], [4, 5, 6]]

---

(source_file
  (variable_definition
    pattern: (identifier)
    type: (array_type
      dimensions: (array_dimensions
        (integer_literal)
        (integer_literal))
      element: (primitive_type))
    value: (array_expression
      (array_expression
        (integer_literal) (integer_literal) (integer_literal))
      (array_expression
        (integer_literal) (integer_literal) (integer_literal)))))

========
Variable definition with anonymous array dimension
========

let xs: [_]i32 = [1, 2, 3]

---

(source_file
  (variable_definition
    pattern: (identifier)
    type: (array_type
      dimensions: (array_dimensions
        (anonymous))
      element: (primitive_type))
    value: (array_expression
      (integer_literal)
      (integer_literal)
      (integer_literal))))


========
Function call with positional and named arguments
========

clamp(10, min=0, max=20)

---

(source_file
  (call_expression
    function: (identifier)
    arguments: (arguments
      (integer_literal)
      (keyword_argument
        name: (identifier)
        value: (integer_literal))
      (keyword_argument
        name: (identifier)
        value: (integer_literal)))))

========
Function call with no arguments
========

foo()

---

(source_file
  (call_expression
    function: (identifier)
    arguments: (arguments)))


========
Function definition with one parameter
========

fn double(x: i32) -> i32 { x * 2 }

---

(source_file
  (function_definition
    name: (identifier)
    parameters: (parameters
      (parameter
        pattern: (identifier)
        type: (primitive_type)))
    return_type: (primitive_type)
    body: (block
      (binary_expression
        left: (identifier)
        operator: (multiply)
        right: (integer_literal)))))


========
Function definition with two parameters
========

fn sum_of_squares(x: i32, y: i32) -> i32 { x * x + y * y }

---

(source_file
  (function_definition
    name: (identifier)
    parameters: (parameters
      (parameter
        pattern: (identifier)
        type: (primitive_type))
      (parameter
        pattern: (identifier)
        type: (primitive_type)))
    return_type: (primitive_type)
    body: (block
      (binary_expression
        left: (binary_expression
          left: (identifier)
          operator: (multiply)
          right: (identifier))
        operator: (add)
        right: (binary_expression
          left: (identifier)
          operator: (multiply)
          right: (identifier))))))

========
Function definition with no parameters
========

fn forty_two() -> i32 { 42 }

---

(source_file
  (function_definition
    name: (identifier)
    parameters: (parameters)
    return_type: (primitive_type)
    body: (block (integer_literal))))


========
Generic Function definition with tuple pattern for parameter
========

fn first[T, U]((a, b): (T, U)) -> T { a }

---

(source_file
  (function_definition
    name: (identifier)
    type_parameters: (type_parameters
      (type_parameter
        name: (type_identifier))
      (type_parameter
        name: (type_identifier)))
    parameters: (parameters
      (parameter
        pattern: (tuple_pattern
          (identifier)
          (identifier))
        type: (tuple_type
          (type_identifier)
          (type_identifier))))
    return_type: (type_identifier)
    body: (block (identifier))))

========
Multi line function definition
========

fn sum_of_squares[T: Num](x: T, y: T) -> T {
  let x2 = x * x
  let y2 = y * y
  x2 + y2
}

---

(source_file
  (function_definition
    name: (identifier)
    type_parameters: (type_parameters
      (type_parameter
        name: (type_identifier)
        bounds: (trait_bounds (type_identifier))))
    parameters: (parameters
      (parameter
        pattern: (identifier)
        type: (type_identifier))
      (parameter
        pattern: (identifier)
        type: (type_identifier)))
    return_type: (type_identifier)
    body: (block
      (variable_definition
        pattern: (identifier)
        value: (binary_expression
          left: (identifier)
          operator: (multiply)
          right: (identifier)))
      (variable_definition
        pattern: (identifier)
        value: (binary_expression
          left: (identifier)
          operator: (multiply)
          right: (identifier)))
      (binary_expression
        left: (identifier)
        operator: (add)
        right: (identifier)))))

========
Index expression with single index
========

c[i]

---

(source_file
  (index_expression
    array: (identifier)
    indices: (indices
      (identifier))))

========
Index expression with multiple indices
========

xs[i, j]

---

(source_file
  (index_expression
    array: (identifier)
    indices: (indices
      (identifier)
      (identifier))))


========
For expression with single index
========

for i { c[i] * 2 }

---

(source_file
  (for_expression
    index_variables: (index_variables
      (identifier))
    body: (block
      (binary_expression
        left: (index_expression
          array: (identifier)
          indices: (indices
            (identifier)))
        operator: (multiply)
        right: (integer_literal)))))


========
Transpose function
========

fn transpose[T, m, n](matrix: [m, n]T) -> [n, m]T {
  for i, j { matrix[j, i] }
}

---

(source_file
  (function_definition
    name: (identifier)
    type_parameters: (type_parameters
      (type_parameter
        name: (type_identifier))
      (type_parameter
        name: (type_identifier))
      (type_parameter
        name: (type_identifier)))
    parameters: (parameters
      (parameter
        pattern: (identifier)
        type: (array_type
          dimensions: (array_dimensions
            (identifier)
            (identifier))
          element: (type_identifier))))
    return_type: (array_type
      dimensions: (array_dimensions
        (identifier)
        (identifier))
      element: (type_identifier))
    body: (block
      (for_expression
        index_variables: (index_variables
          (identifier)
          (identifier))
        body: (block
          (index_expression
            array: (identifier)
            indices: (indices
              (identifier)
              (identifier))))))))

========
Struct definition with two fields
========

struct Point {
    x: i32
    y: i32
}

let point = Point(x=20, y=30)

---

(source_file
  (struct_definition
    name: (identifier)
    fields: (fields
      (field
        name: (identifier)
        type: (primitive_type))
      (field
        name: (identifier)
        type: (primitive_type))))
  (variable_definition
    pattern: (identifier)
    value: (call_expression
      function: (identifier)
      arguments: (arguments
        (keyword_argument
          name: (identifier)
          value: (integer_literal))
        (keyword_argument
          name: (identifier)
          value: (integer_literal))))))


========
Generic struct definition
========

struct Linear[T: Num, in, out] {
    weights: [out, in]T
    bias: [out]T
}

---

(source_file
  (struct_definition
    name: (identifier)
    type_parameters: (type_parameters
      (type_parameter
        name: (type_identifier)
        bounds: (trait_bounds (type_identifier)))
      (type_parameter
        name: (type_identifier))
      (type_parameter
        name: (type_identifier)))
    fields: (fields
      (field
        name: (identifier)
        type: (array_type
          dimensions: (array_dimensions
            (identifier)
            (identifier))
          element: (type_identifier)))
      (field
        name: (identifier)
        type: (array_type
          dimensions: (array_dimensions
            (identifier))
          element: (type_identifier))))))


========
If then else expression
========

if x > y { x } else { y }

---

(source_file
  (if_expression
    condition: (binary_expression
      left: (identifier)
      operator: (greater)
      right: (identifier))
    then: (block (identifier))
    else: (block (identifier))))


========
If then elif else expression
========

if x < min { min }
elif x > max { max }
else { x }

---

(source_file
  (if_expression
    condition: (binary_expression
      left: (identifier)
      operator: (less)
      right: (identifier))
    then: (block (identifier))
    elifs: (elifs
      (elif
        condition: (binary_expression
          left: (identifier)
          operator: (greater)
          right: (identifier))
        then: (block (identifier))))
    else: (block (identifier))))

========
Field access expression
========

point.x
foo.bar.baz

---

(source_file
  (field_access_expression
    object: (identifier)
    field: (identifier))
  (field_access_expression
    object: (field_access_expression
      object: (identifier)
      field: (identifier))
    field: (identifier)))

========
Method call expression
========

point.with(x=10)
foo.bar(42).baz(true)

---

(source_file
  (method_call_expression
    object: (identifier)
    method: (identifier)
    arguments: (arguments
      (keyword_argument
        name: (identifier)
        value: (integer_literal))))
  (method_call_expression
    object: (method_call_expression
      object: (identifier)
      method: (identifier)
      arguments: (arguments
        (integer_literal)))
    method: (identifier)
    arguments: (arguments
      (boolean_literal))))
